---
kind: type
id: T:Autodesk.Revit.Exceptions.ExternalApplicationException
source: html/06e9a9a5-c212-2708-3151-301c1f33a96a.htm
---
# Autodesk.Revit.Exceptions.ExternalApplicationException

The exception that is thrown when an issue in the Add-Ins resulted in an unexpected error.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class ExternalApplicationException : ApplicationException
```

## Remarks
Please contact your external application provider with the information about what led to this exception.